Repository: beyondReal-smap/native
Catalog: ios/smap/*.lproj/Localizable.strings
Languages: es, hi, id, ja, ms, th, vi

# LOCATION_PERMISSION_TITLE
source: Set permissions to provide accurate location information
es: Establecer permisos para proporcionar información de ubicación precisa
hi: सटीक स्थान जानकारी प्रदान करने के लिए अनुमतियां सेट करें
id: Atur izin untuk memberikan informasi lokasi yang akurat
ja: 正確な位置情報を提供するための権限を設定してください
ms: Tetapkan kebenaran untuk memberikan maklumat lokasi yang tepat
th: ตั้งค่าสิทธิ์เพื่อให้ข้อมูลตำแหน่งที่ถูกต้อง
vi: Cấp quyền để cung cấp thông tin vị trí chính xác

# LOCATION_PERMISSION_MESSAGE
source: To fully utilize the customized information and features provided by the SMAP app, you need to set the location permission to "Always Allow". Tap the "Go to Settings" button to navigate to the app settings and change the location permission.
es: Para aprovechar al máximo la información y las funciones personalizadas que ofrece la aplicación SMAP, debe establecer el permiso de ubicación en "Permitir siempre". Toque el botón "Ir a Ajustes" para ir a la configuración de la aplicación y cambiar el permiso de ubicación.
id: Untuk memanfaatkan sepenuhnya informasi dan fitur yang disediakan oleh aplikasi SMAP, Anda perlu mengatur izin lokasi ke "Selalu Izinkan". Tap tombol "Buka Pengaturan" untuk membuka pengaturan aplikasi dan mengubah izin lokasi.
ja: SMAPアプリで提供されるカスタマイズ情報や機能を最大限に活用するには、位置情報の権限を「常に許可」に設定する必要があります。 「設定に移動」ボタンをタップして、アプリの設定に移動し、位置情報の権限を変更してください。
ms: Untuk sepenuhnya memanfaatkan maklumat dan ciri-ciri tersuai yang disediakan oleh aplikasi SMAP, anda perlu menetapkan kebenaran lokasi kepada "Sentiasa Benarkan". Tap butang "Pergi ke Tetapan" untuk menavigasi ke tetapan aplikasi dan menukar kebenaran lokasi.
th: เพื่อใช้ประโยชน์จากข้อมูลและฟีเจอร์ที่ปรับแต่งได้ของแอพ SMAP อย่างเต็มที่ คุณต้องตั้งค่าสิทธิ์ตำแหน่งเป็น "อนุญาตตลอด" แตะปุ่ม "ไปที่การตั้งค่า" เพื่อไปที่การตั้งค่าแอพและเปลี่ยนสิทธิ์ตำแหน่ง
vi: Bạn cần cấp quyền truy cập vị trí "Luôn cho phép" để tận hưởng tối đa các tính năng và thông tin tùy chỉnh mà ứng dụng SMAP cung cấp. Nhấn nút "Đến Cài đặt" để chuyển đến cài đặt ứng dụng và thay đổi quyền truy cập vị trí.

# LOCATION_PERMISSION_SETTINGS_BUTTON
source: Go to Settings
es: Ir a Ajustes
hi: सेटिंग्स पर जाएं
id: Buka Pengaturan
ja: 設定に移動
ms: Pergi ke Tetapan
th: ไปที่การตั้งค่า
vi: Đến Cài đặt

# LOCATION_PERMISSION_CANCEL_BUTTON
source: Cancel
es: Cancelar
hi: रद्द करें
id: Batal
ja: キャンセル
ms: Batal
th: ยกเลิก
vi: Hủy

# IMAGE_LOAD_FAIL_MESSAGE
source: Failed to load image information.
es: Error al cargar la información de la imagen.
hi: इमेज जानकारी लोड करने में विफल।
id: Gagal memuat informasi gambar.
ja: 画像情報の読み込みに失敗しました。
ms: Gagal memuatkan maklumat imej.
th: ไม่สามารถโหลดข้อมูลรูปภาพ
vi: Không thể tải thông tin hình ảnh.

# CLIPBOARD_COPIED_MESSAGE
source: Copied to clipboard.
es: Copiado al portapapeles.
hi: क्लिपबोर्ड पर कॉपी किया गया।
id: Disalin ke papan klip.
ja: クリップボードにコピーされました。
ms: Disalin ke papan keratan.
th: คัดลอกไปยังคลิปบอร์ดแล้ว
vi: Đã sao chép vào khay nhớ tạm.

# ALERT_OK_BUTTON
source: OK
es: Aceptar
hi: ठीक है
th: ตกลง

# ALERT_CANCEL_BUTTON
source: Cancel
es: Cancelar
hi: रद्द करें
id: Batal
ja: キャンセル
ms: Batal
th: ยกเลิก
vi: Hủy

# NSPhotoLibraryUsageDescription
source: The SMAP app needs access to your photo library to enjoy various features.
es: La aplicación SMAP necesita acceso a tu biblioteca de fotos para disfrutar de varias funciones.
hi: विभिन्न सुविधाओं का आनंद लेने के लिए SMAP ऐप को आपकी फोटो लाइब्रेरी की अनुमति चाहिए।
id: Aplikasi SMAP membutuhkan akses ke perpustakaan foto Anda untuk menikmati berbagai fitur.
ja: SMAPアプリでは、さまざまな機能を楽しむために、写真ライブラリへのアクセスが必要です。
ms: Aplikasi SMAP memerlukan akses ke perpustakaan foto anda untuk menikmati pelbagai ciri.
th: แอพ SMAP ต้องการเข้าถึงห้องสมุดรูปภาพของคุณเพื่อใช้ฟีเจอร์ต่างๆ
vi: Ứng dụng SMAP cần quyền truy cập thư viện ảnh để sử dụng các tính năng đa dạng.

# NSLocationWhenInUseUsageDescription
source: Please set the location permission to "Allow While Using" to verify your location and share it with group members.
es: Establece el permiso de ubicación en "Permitir mientras se usa" para verificar tu ubicación y compartirla con los miembros del grupo.
id: Harap atur izin lokasi ke "Izinkan Saat Digunakan" untuk memverifikasi lokasi Anda dan membagikannya dengan anggota grup.
ja: 位置情報を確認してグループメンバーと共有するには、位置情報の権限を「使用中のみ許可」に設定してください。
ms: Sila tetapkan kebenaran lokasi kepada "Benarkan Semasa Menggunakan" untuk mengesahkan lokasi anda dan berkongsinya dengan ahli kumpulan.
th: โปรดตั้งค่าสิทธิ์ตำแหน่งเป็น "อนุญาตขณะใช้งาน" เพื่อยืนยันตำแหน่งของคุณและแชร์กับสมาชิกในกลุ่ม
vi: Vui lòng cấp quyền truy cập vị trí "Khi đang sử dụng" để xác minh vị trí của bạn và chia sẻ vị trí với các thành viên nhóm.

# NSLocationAlwaysAndWhenInUseUsageDescription
source: Please set the location permission to "Always Allow" to verify your location and share it with group members.
es: Establece el permiso de ubicación en "Permitir siempre" para verificar tu ubicación y compartirla con los miembros del grupo.
id: Harap atur izin lokasi ke "Selalu Izinkan" untuk memverifikasi lokasi Anda dan membagikannya dengan anggota grup.
ja: 位置情報を確認してグループメンバーと共有するには、位置情報の権限を「常に許可」に設定してください。
ms: Sila tetapkan kebenaran lokasi kepada "Sentiasa Benarkan" untuk mengesahkan lokasi anda dan berkongsinya dengan ahli kumpulan.
th: โปรดตั้งค่าสิทธิ์ตำแหน่งเป็น "อนุญาตตลอด" เพื่อยืนยันตำแหน่งของคุณและแชร์กับสมาชิกในกลุ่ม
vi: Vui lòng cấp quyền truy cập vị trí "Luôn cho phép" để xác minh vị trí của bạn và chia sẻ vị trí với các thành viên nhóm.

# NSCameraUsageDescription
source: The app needs camera access to upload a profile picture.
es: La aplicación necesita acceso a la cámara para subir una foto de perfil.
hi: ऐप को प्रोफाइल पिक्चर अपलोड करने के लिए कैमरा एक्सेस की आवश्यकता है।
id: Aplikasi membutuhkan akses kamera untuk mengunggah foto profil.
ja: プロフィール画像をアップロードするには、カメラへのアクセスが必要です。
ms: Aplikasi memerlukan akses kamera untuk memuat naik gambar profil.
th: แอพต้องการเข้าถึงกล้องเพื่ออัปโหลดรูปโปรไฟล์
vi: Ứng dụng cần quyền truy cập camera để tải lên ảnh đại diện.

# NSLocationAlwaysUsageDescription
source: The app needs this permission to verify your location and share it with group members.
es: La aplicación necesita este permiso para verificar tu ubicación y compartirla con los miembros del grupo.
hi: आपके स्थान को सत्यापित करने और समूह के सदस्यों के साथ साझा करने के लिए ऐप को इस अनुमति की आवश्यकता है।
id: Aplikasi membutuhkan izin ini untuk memverifikasi lokasi Anda dan membagikannya dengan anggota grup.
ja: 位置情報を確認してグループメンバーと共有するため、このアプリにはこの権限が必要です。
ms: Aplikasi memerlukan kebenaran ini untuk mengesahkan lokasi anda dan berkongsinya dengan ahli kumpulan.
th: แอพต้องการสิทธิ์นี้เพื่อยืนยันตำแหน่งของคุณและแชร์กับสมาชิกในกลุ่ม
vi: Ứng dụng cần quyền này để xác minh vị trí của bạn và chia sẻ vị trí với các thành viên nhóm.

# NSMicrophoneUsageDescription
source: The app needs microphone access for taking photos.
es: La aplicación necesita acceso al micrófono para tomar fotos.
hi: फोटो लेने के लिए ऐप को माइक्रोफोन एक्सेस की आवश्यकता है।
id: Aplikasi membutuhkan akses mikrofon untuk mengambil foto.
ja: 写真を撮影するには、マイクへのアクセスが必要です。
ms: Aplikasi memerlukan akses mikrofon untuk mengambil gambar.
th: แอพต้องการเข้าถึงไมโครโฟนเพื่อถ่ายรูป
vi: Ứng dụng cần quyền truy cập microphone để chụp ảnh.

# NSMotionUsageDescription
source: The app needs location access to track your step count.
es: La aplicación necesita acceso a la ubicación para hacer un seguimiento de tus pasos.
hi: आपके कदम गिनने के लिए ऐप को स्थान एक्सेस की आवश्यकता है।
id: Aplikasi membutuhkan akses lokasi untuk melacak hitungan langkah Anda.
ja: 歩数を計測するには、位置情報へのアクセスが必要です。
ms: Aplikasi memerlukan akses lokasi untuk menjejak kiraan langkah anda.
th: แอพต้องการเข้าถึงตำแหน่งเพื่อติดตามจำนวนก้าวของคุณ
vi: Ứng dụng cần quyền truy cập vị trí để theo dõi số bước đi của bạn.
